nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.h
#define  GPIO_MODE_INPUT               ((uint32_t)0x00000000U)   /*!< Input Floating Mode                   */
#define  GPIO_MODE_OUTPUT_PP           ((uint32_t)0x00000001U)   /*!< Output Push Pull Mode                 */
#define  GPIO_MODE_OUTPUT_OD           ((uint32_t)0x00000011U)   /*!< Output Open Drain Mode                */
#define  GPIO_MODE_AF_PP               ((uint32_t)0x00000002U)   /*!< Alternate Function Push Pull Mode     */
#define  GPIO_MODE_AF_OD               ((uint32_t)0x00000012U)   /*!< Alternate Function Open Drain Mode    */
#define  GPIO_MODE_ANALOG              ((uint32_t)0x00000003U)   /*!< Analog Mode  */

#define  GPIO_MODE_IT_RISING           ((uint32_t)0x10110000U)   /*!< External Interrupt Mode with Rising edge trigger detection          */
#define  GPIO_MODE_IT_FALLING          ((uint32_t)0x10210000U)   /*!< External Interrupt Mode with Falling edge trigger detection         */
#define  GPIO_MODE_IT_RISING_FALLING   ((uint32_t)0x10310000U)   /*!< External Interrupt Mode with Rising/Falling edge trigger detection  */

#define  GPIO_MODE_EVT_RISING          ((uint32_t)0x10120000U)   /*!< External Event Mode with Rising edge trigger detection               */
#define  GPIO_MODE_EVT_FALLING         ((uint32_t)0x10220000U)   /*!< External Event Mode with Falling edge trigger detection              */
#define  GPIO_MODE_EVT_RISING_FALLING  ((uint32_t)0x10320000U)   /*!< External Event Mode with Rising/Falling edge trigger detection       */

#define GPIO_NOPULL                    ((uint32_t)0x00000000U)   // No Pull-up or Pull-down activation
#define GPIO_PULLUP                    ((uint32_t)0x00000001U)   // Pull-up activation
#define GPIO_PULLDOWN                  ((uint32_t)0x00000002U)   /*!< Pull-down activation                */

#define GPIO_MODE                      ((uint32_t)0x00000003U)
#define EXTI_MODE                      ((uint32_t)0x10000000U)
#define GPIO_MODE_IT                   ((uint32_t)0x00010000U)
#define GPIO_MODE_EVT                  ((uint32_t)0x00020000U)
#define GPIO_OUTPUT_TYPE               ((uint32_t)0x00000010U)

#define GPIO_NUMBER                    ((uint32_t)16U)
#define GPIO_SPEED_FREQ_HIGH           ((uint32_t)0x00000002U)  /*!< Fast speed    */
#define GPIO_SPEED_FAST                GPIO_SPEED_FREQ_HIGH
#define GPIO_SPEED_FREQ_VERY_HIGH      ((uint32_t)0x00000003U)   //  High speed
#define GPIO_SPEED_HIGH                GPIO_SPEED_FREQ_VERY_HIGH

typedef struct
{
    uint32_t Pin;       /*!< Specifies the GPIO pins to be configured.
                             This parameter can be any value of @ref GPIO_pins_define */
    uint32_t Mode;      /*!< Specifies the operating mode for the selected pins.
                             This parameter can be a value of @ref GPIO_mode_define */
    uint32_t Pull;      /*!< Specifies the Pull-up or Pull-Down activation for the selected pins.
                             This parameter can be a value of @ref GPIO_pull_define */
    uint32_t Speed;     /*!< Specifies the speed for the selected pins.
                             This parameter can be a value of @ref GPIO_speed_define */
    uint32_t Alternate;  /*!< Peripheral to be connected to the selected pins.
                              This parameter can be a value of @ref GPIO_Alternate_function_selection */
} GPIO_InitTypeDef;






#define HAL_DSI_ERROR_NONE          0U
#define DSI_PLL_IN_DIV1             0x00000001U
#define DSI_PLL_IN_DIV2             0x00000002U
#define DSI_PLL_IN_DIV3             0x00000003U
#define DSI_PLL_IN_DIV4             0x00000004U
#define DSI_PLL_IN_DIV5             0x00000005U
#define DSI_PLL_IN_DIV6             0x00000006U
#define DSI_PLL_IN_DIV7             0x00000007U

#define DSI_PLL_OUT_DIV1            0x00000000U
#define DSI_PLL_OUT_DIV2            0x00000001U
#define DSI_PLL_OUT_DIV4            0x00000002U
#define DSI_PLL_OUT_DIV8            0x00000003U

#define __HAL_DSI_REG_ENABLE(__HANDLE__) do { \
                                                  __IO uint32_t tmpreg = 0x00U; \
                                                  SET_BIT((__HANDLE__)->Instance->WRPCR, DSI_WRPCR_REGEN);\
                                                  /* Delay after an DSI regulator enabling */ \
                                                  tmpreg = READ_BIT((__HANDLE__)->Instance->WRPCR, DSI_WRPCR_REGEN);\
                                                  UNUSED(tmpreg); \
                                                } while(0U)

#define MAX_LAYER                      2
#define DSI_FLAG_RRS                   DSI_WISR_RRS
#define DSI_TIMEOUT_VALUE              ((uint32_t)1000U)  /* 1s */
#define DSI_ONE_DATA_LANE              0U
#define DSI_TWO_DATA_LANES             1U
#define DSI_VMCR_LPCE_Pos              (15U)                                    
#define DSI_VMCR_LPCE_Msk              (0x1U << DSI_VMCR_LPCE_Pos)              /*!< 0x00008000 */
#define DSI_VMCR_LPCE                  DSI_VMCR_LPCE_Msk                        /*!< Low-Power Command Enable */
#define DSI_VMCR_LPHFPE_Pos            (13U)                                    
#define DSI_VMCR_LPHFPE_Msk            (0x1U << DSI_VMCR_LPHFPE_Pos)            /*!< 0x00002000 */
#define DSI_VMCR_LPHFPE                DSI_VMCR_LPHFPE_Msk                      /*!< Low-Power Horizontal Front-Porch Enable */
#define DSI_LP_HFP_ENABLE              DSI_VMCR_LPHFPE
#define DSI_VMCR_LPHBPE_Pos            (12U)                                    
#define DSI_VMCR_LPHBPE_Msk            (0x1U << DSI_VMCR_LPHBPE_Pos)            /*!< 0x00001000 */
#define DSI_VMCR_LPHBPE                DSI_VMCR_LPHBPE_Msk                      /*!< Low-Power Horizontal Back-Porch Enable */
#define DSI_LP_HBP_ENABLE              DSI_VMCR_LPHBPE
#define DSI_VMCR_LPVAE_Pos             (11U)                                    
#define DSI_VMCR_LPVAE_Msk             (0x1U << DSI_VMCR_LPVAE_Pos)             /*!< 0x00000800 */
#define DSI_VMCR_LPVAE                 DSI_VMCR_LPVAE_Msk                       /*!< Low-Power Vertical Active Enable */
#define DSI_LP_VACT_ENABLE             DSI_VMCR_LPVAE
#define DSI_VMCR_LPVFPE_Pos            (10U)                                    
#define DSI_VMCR_LPVFPE_Msk            (0x1U << DSI_VMCR_LPVFPE_Pos)            /*!< 0x00000400 */
#define DSI_VMCR_LPVFPE                DSI_VMCR_LPVFPE_Msk                      /*!< Low-power Vertical Front-porch Enable */
#define DSI_LP_VFP_ENABLE              DSI_VMCR_LPVFPE
#define DSI_VMCR_LPVBPE_Pos            (9U)                                     
#define DSI_VMCR_LPVBPE_Msk            (0x1U << DSI_VMCR_LPVBPE_Pos)            /*!< 0x00000200 */
#define DSI_VMCR_LPVBPE                DSI_VMCR_LPVBPE_Msk                      /*!< Low-power Vertical Back-Porch Enable */
#define DSI_LP_VBP_ENABLE              DSI_VMCR_LPVBPE
#define DSI_VMCR_LPVSAE_Pos            (8U)                                     
#define DSI_VMCR_LPVSAE_Msk            (0x1U << DSI_VMCR_LPVSAE_Pos)            /*!< 0x00000100 */
#define DSI_VMCR_LPVSAE                DSI_VMCR_LPVSAE_Msk                      /*!< Low-Power Vertical Sync Active Enable */
#define DSI_LP_VSYNC_ENABLE            DSI_VMCR_LPVSAE
#define DSI_LOOSELY_PACKED_ENABLE      DSI_LCOLCR_LPE
#define DSI_LOOSELY_PACKED_DISABLE     0x00000000U
#define RCC_PERIPHCLK_LTDC             ((uint32_t)0x00000008U)
#define DSI_AUTO_CLK_LANE_CTRL_DISABLE 0x00000000U
#define DSI_AUTO_CLK_LANE_CTRL_ENABLE  DSI_CLCR_ACR
#define DSI_RGB565                     0x00000000U /*!< The values 0x00000001 and 0x00000002 can also be used for the RGB565 color mode configuration */
#define DSI_RGB666                     0x00000003U /*!< The value 0x00000004 can also be used for the RGB666 color mode configuration                 */
#define DSI_RGB888                     0x00000005U
#define DSI_FLAG_PLLLS                 DSI_WISR_PLLLS

#define IS_DSI_COLOR_CODING(ColorCoding)          ((ColorCoding) <= 5U)
#define IS_DSI_LOOSELY_PACKED(LooselyPacked)      (((LooselyPacked) == DSI_LOOSELY_PACKED_ENABLE) || ((LooselyPacked) == DSI_LOOSELY_PACKED_DISABLE))
#define IS_DSI_PLL_NDIV(NDIV)                     ((10U <= (NDIV)) && ((NDIV) <= 125U))
#define IS_DSI_PLL_IDF(IDF)                       (((IDF) == DSI_PLL_IN_DIV1)  || \
                                                  ((IDF) == DSI_PLL_IN_DIV2)   || \
                                                  ((IDF) == DSI_PLL_IN_DIV3)   || \
                                                  ((IDF) == DSI_PLL_IN_DIV4)   || \
                                                  ((IDF) == DSI_PLL_IN_DIV5)   || \
                                                  ((IDF) == DSI_PLL_IN_DIV6)   || \
                                                  ((IDF) == DSI_PLL_IN_DIV7))
#define IS_DSI_PLL_ODF(ODF)                       (((ODF) == DSI_PLL_OUT_DIV1) || \
                                                  ((ODF) == DSI_PLL_OUT_DIV2)  || \
                                                  ((ODF) == DSI_PLL_OUT_DIV4)  || \
                                                  ((ODF) == DSI_PLL_OUT_DIV8))
#define IS_DSI_AUTO_CLKLANE_CONTROL(AutoClkLane)  (((AutoClkLane) == DSI_AUTO_CLK_LANE_CTRL_DISABLE) || ((AutoClkLane) == DSI_AUTO_CLK_LANE_CTRL_ENABLE))
#define IS_DSI_NUMBER_OF_LANES(NumberOfLanes)     (((NumberOfLanes) == DSI_ONE_DATA_LANE) || ((NumberOfLanes) == DSI_TWO_DATA_LANES))
#define __HAL_DSI_PLL_DISABLE(__HANDLE__) do { \
                                              __IO uint32_t tmpreg = 0x00U; \
                                              CLEAR_BIT((__HANDLE__)->Instance->WRPCR, DSI_WRPCR_PLLEN);\
                                              /* Delay after an DSI PLL disabling */ \
                                              tmpreg = READ_BIT((__HANDLE__)->Instance->WRPCR, DSI_WRPCR_PLLEN);\
                                              UNUSED(tmpreg); \
                                             } while(0U)
#define __HAL_DSI_DISABLE(__HANDLE__) do { \
                                          __IO uint32_t tmpreg = 0x00U; \
                                          CLEAR_BIT((__HANDLE__)->Instance->CR, DSI_CR_EN);\
                                          /* Delay after an DSI Host disabling */ \
                                          tmpreg = READ_BIT((__HANDLE__)->Instance->CR, DSI_CR_EN);\
                                          UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_DSI_WRAPPER_DISABLE(__HANDLE__) do { \
                                                  __IO uint32_t tmpreg = 0x00U; \
                                                  CLEAR_BIT((__HANDLE__)->Instance->WCR, DSI_WCR_DSIEN);\
                                                  /* Delay after an DSI warpper disabling*/ \
                                                  tmpreg = READ_BIT((__HANDLE__)->Instance->WCR, DSI_WCR_DSIEN);\
                                                  UNUSED(tmpreg); \
                                                 } while(0U)
#define __HAL_DSI_REG_DISABLE(__HANDLE__) do { \
                                              __IO uint32_t tmpreg = 0x00U; \
                                              CLEAR_BIT((__HANDLE__)->Instance->WRPCR, DSI_WRPCR_REGEN);\
                                              /* Delay after an DSI regulator disabling */ \
                                              tmpreg = READ_BIT((__HANDLE__)->Instance->WRPCR, DSI_WRPCR_REGEN);\
                                              UNUSED(tmpreg); \
                                             } while(0U)
#define __HAL_DSI_GET_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->WISR & (__FLAG__))
#define __HAL_DSI_PLL_ENABLE(__HANDLE__) do { \
                                                 __IO uint32_t tmpreg = 0x00U; \
                                                 SET_BIT((__HANDLE__)->Instance->WRPCR, DSI_WRPCR_PLLEN);\
                                                 /* Delay after an DSI PLL enabling */ \
                                                 tmpreg = READ_BIT((__HANDLE__)->Instance->WRPCR, DSI_WRPCR_PLLEN);\
                                                 UNUSED(tmpreg); \
                                                } while(0U)
#define __HAL_RCC_DSI_RELEASE_RESET()    (RCC->APB2RSTR &= ~(RCC_APB2RSTR_DSIRST))
#define __HAL_RCC_DSI_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->APB2ENR, RCC_APB2ENR_DSIEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_DSIEN);\
                                        UNUSED(tmpreg); \
                                      } while(0)
#define DSI_DCS_SHORT_PKT_WRITE_P1    ((uint32_t)0x00000015U) /*!< DCS short write, one parameter      */
#define DSI_DCS_LONG_PKT_WRITE              0x00000039U /*!< DCS long write     */
#define DSI_GEN_LONG_PKT_WRITE              0x00000029U /*!< Generic long write */
#define IS_DSI_LONG_WRITE_PACKET_TYPE(MODE)         (((MODE) == DSI_DCS_LONG_PKT_WRITE) || \
                                                     ((MODE) == DSI_GEN_LONG_PKT_WRITE))
typedef enum
{
    HAL_DSI_STATE_RESET = 0x00U,
    HAL_DSI_STATE_READY = 0x01U,
    HAL_DSI_STATE_ERROR = 0x02U,
    HAL_DSI_STATE_BUSY = 0x03U,
    HAL_DSI_STATE_TIMEOUT = 0x04U
} HAL_DSI_StateTypeDef;
typedef struct
{
    uint32_t PLLNDIV; // PLL Loop Division Factor
                      // This parameter must be a value between 10 and 125   
    uint32_t PLLIDF;  // PLL Input Division Factor
                      // This parameter can be any value of @ref DSI_PLL_IDF 
    uint32_t PLLODF;  // PLL Output Division Factor
                      // This parameter can be any value of @ref DSI_PLL_ODF 
} DSI_PLLInitTypeDef;



#define __HAL_UNLOCK(__HANDLE__)  do{ (__HANDLE__)->Lock = HAL_UNLOCKED;  } while (0U)




