nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.h
typedef enum
{
    HAL_LTDC_STATE_RESET = 0x00U,    // LTDC not yet initialized or disabled 
    HAL_LTDC_STATE_READY = 0x01U,    // LTDC initialized and ready for use   
    HAL_LTDC_STATE_BUSY = 0x02U,    // LTDC internal process is ongoing     
    HAL_LTDC_STATE_TIMEOUT = 0x03U,    // LTDC Timeout state                   
    HAL_LTDC_STATE_ERROR = 0x04U     // LTDC state error                     
} HAL_LTDC_StateTypeDef;
typedef struct
{
    uint8_t Blue;                    // Configures the blue value.
                                     // This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. */
    uint8_t Green;                   // Configures the green value.
                                     // This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. */
    uint8_t Red;                     // Configures the red value.
                                     // This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. */
    uint8_t Reserved;                // Reserved 0xFF */
} LTDC_ColorTypeDef;
typedef struct
{
    uint32_t WindowX0;                   // Configures the Window Horizontal Start Position.
                                         // This parameter must be a number between Min_Data = 0x000 and Max_Data = 0xFFF. 
    uint32_t WindowX1;                   // Configures the Window Horizontal Stop Position.
                                         // This parameter must be a number between Min_Data = 0x000 and Max_Data = 0xFFF. 
    uint32_t WindowY0;                   // Configures the Window vertical Start Position.
                                         // This parameter must be a number between Min_Data = 0x000 and Max_Data = 0x7FF. 
    uint32_t WindowY1;                   // Configures the Window vertical Stop Position.
                                         // This parameter must be a number between Min_Data = 0x0000 and Max_Data = 0x7FF. 
    uint32_t PixelFormat;                // Specifies the pixel format.
                                         // This parameter can be one of value of @ref LTDC_Pixelformat 
    uint32_t Alpha;                      // Specifies the constant alpha used for blending.
                                         // This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. 
    uint32_t Alpha0;                     // Configures the default alpha value.
                                         // This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. 
    uint32_t BlendingFactor1;            // Select the blending factor 1.
                                         // This parameter can be one of value of @ref LTDC_BlendingFactor1 
    uint32_t BlendingFactor2;            // Select the blending factor 2.
                                         // This parameter can be one of value of @ref LTDC_BlendingFactor2 
    uint32_t FBStartAdress;              // Configures the color frame buffer address 
    uint32_t ImageWidth;                 // Configures the color frame buffer line length.
                                         // This parameter must be a number between Min_Data = 0x0000 and Max_Data = 0x1FFF. 
    uint32_t ImageHeight;                // Specifies the number of line in frame buffer.
                                         // This parameter must be a number between Min_Data = 0x000 and Max_Data = 0x7FF. 
    LTDC_ColorTypeDef   Backcolor;       // Configures the layer background color. 
} LTDC_LayerCfgTypeDef;
typedef struct
{
    uint32_t            HSPolarity;                // configures the horizontal synchronization polarity.
                                                   // This parameter can be one value of @ref LTDC_HS_POLARITY 
    uint32_t            VSPolarity;                // configures the vertical synchronization polarity.
                                                   // This parameter can be one value of @ref LTDC_VS_POLARITY 
    uint32_t            DEPolarity;                // configures the data enable polarity.
                                                   // This parameter can be one of value of @ref LTDC_DE_POLARITY 
    uint32_t            PCPolarity;                // configures the pixel clock polarity.
                                                   // This parameter can be one of value of @ref LTDC_PC_POLARITY 
    uint32_t            HorizontalSync;            // configures the number of Horizontal synchronization width.
                                                   // This parameter must be a number between Min_Data = 0x000 and Max_Data = 0xFFF. 
    uint32_t            VerticalSync;              // configures the number of Vertical synchronization height.
                                                   // This parameter must be a number between Min_Data = 0x000 and Max_Data = 0x7FF. 
    uint32_t            AccumulatedHBP;            // configures the accumulated horizontal back porch width.
                                                   // This parameter must be a number between Min_Data = LTDC_HorizontalSync and Max_Data = 0xFFF. 
    uint32_t            AccumulatedVBP;            // configures the accumulated vertical back porch height.
                                                   // This parameter must be a number between Min_Data = LTDC_VerticalSync and Max_Data = 0x7FF. 
    uint32_t            AccumulatedActiveW;        // configures the accumulated active width.
                                                   // This parameter must be a number between Min_Data = LTDC_AccumulatedHBP and Max_Data = 0xFFF. 
    uint32_t            AccumulatedActiveH;        // configures the accumulated active height.
                                                   // This parameter must be a number between Min_Data = LTDC_AccumulatedVBP and Max_Data = 0x7FF. 
    uint32_t            TotalWidth;                // configures the total width.
                                                   // This parameter must be a number between Min_Data = LTDC_AccumulatedActiveW and Max_Data = 0xFFF. 
    uint32_t            TotalHeigh;                // configures the total height.
                                                   // This parameter must be a number between Min_Data = LTDC_AccumulatedActiveH and Max_Data = 0x7FF. 
    LTDC_ColorTypeDef   Backcolor;                 // Configures the background color. 
} LTDC_InitTypeDef;
