nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.h
typedef enum
{
    HAL_UNLOCKED = 0x00U,
    HAL_LOCKED = 0x01U
} HAL_LockTypeDef;
typedef struct
{
    LTDC_TypeDef* Instance;                // LTDC Register base address                
    LTDC_InitTypeDef            Init;                     // LTDC parameters                           
    LTDC_LayerCfgTypeDef        LayerCfg[MAX_LAYER];      // LTDC Layers parameters                    
    HAL_LockTypeDef             Lock;                     // LTDC Lock                                 
    __IO HAL_LTDC_StateTypeDef  State;                    // LTDC state                                
    __IO uint32_t               ErrorCode;                // LTDC Error code                           
} LTDC_HandleTypeDef;

#define LTDC_LAYER(__HANDLE__, __LAYER__)              ((LTDC_Layer_TypeDef *)((uint32_t)(((uint32_t)((__HANDLE__)->Instance)) + 0x84U + (0x80U*(__LAYER__)))))
#define LTDC_PIXEL_FORMAT_ARGB8888        0x00000000U   /*!< ARGB8888 LTDC pixel format */
#define LTDC_PIXEL_FORMAT_RGB888          0x00000001U   /*!< RGB888 LTDC pixel format   */
#define LTDC_PIXEL_FORMAT_RGB565          0x00000002U   /*!< RGB565 LTDC pixel format   */
#define LTDC_PIXEL_FORMAT_ARGB1555        0x00000003U   /*!< ARGB1555 LTDC pixel format */
#define LTDC_PIXEL_FORMAT_ARGB4444        0x00000004U   /*!< ARGB4444 LTDC pixel format */
#define LTDC_PIXEL_FORMAT_L8              0x00000005U   /*!< L8 LTDC pixel format       */
#define LTDC_PIXEL_FORMAT_AL44            0x00000006U   /*!< AL44 LTDC pixel format     */
#define LTDC_PIXEL_FORMAT_AL88            0x00000007U   /*!< AL88 LTDC pixel format     */
#define LTDC_MAX_LAYER_NUMBER             ((uint32_t) 2)
#define LTDC_BLENDING_FACTOR1_PAxCA    ((uint32_t)0x00000600U)   // Blending factor : Cte Alpha x Pixel Alpha
#define LTDC_BLENDING_FACTOR2_PAxCA    ((uint32_t)0x00000007U)   // Blending factor : Cte Alpha x Pixel Alpha
#define LTDC_PCPOLARITY_IPC            ((uint32_t)0x00000000U)   // input pixel clock.
#define LTDC_DEPOLARITY_AL                0x00000000U   /*!< Data Enable, is active low. */
#define LTDC_DEPOLARITY_AH                LTDC_GCR_DEPOL            /*!< Data Enable, is active high. */
#define LTDC_VSPOLARITY_AH                LTDC_GCR_VSPOL            /*!< Vertical Synchronization is active high. */
#define LTDC_VSPOLARITY_AL                0x00000000U   /*!< Vertical Synchronization is active low. */
#define LTDC_HSPOLARITY_AL                0x00000000U   /*!< Horizontal Synchronization is active low. */
#define LTDC_HSPOLARITY_AH                LTDC_GCR_HSPOL            /*!< Horizontal Synchronization is active high. */
#define LTDC_IT_TE                        LTDC_IER_TERRIE           /*!< LTDC Transfer Error Interrupt  */
#define LTDC_IT_FU                        LTDC_IER_FUIE             /*!< LTDC FIFO Underrun Interrupt   */


typedef enum
{
    HAL_OK = 0x00U,
    HAL_ERROR = 0x01U,
    HAL_BUSY = 0x02U,
    HAL_TIMEOUT = 0x03U
} HAL_StatusTypeDef;
typedef struct
{
    uint32_t PLLI2SN;    // Specifies the multiplication factor for PLLI2S VCO output clock.
                         // This parameter must be a number between Min_Data = 50 and Max_Data = 432.
                         // This parameter will be used only when PLLI2S is selected as Clock Source I2S or SAI 

    uint32_t PLLI2SR;    // Specifies the division factor for I2S clock.
                         // This parameter must be a number between Min_Data = 2 and Max_Data = 7.
                         // This parameter will be used only when PLLI2S is selected as Clock Source I2S or SAI 

    uint32_t PLLI2SQ;    // Specifies the division factor for SAI1 clock.
                         // This parameter must be a number between Min_Data = 2 and Max_Data = 15.
                         // This parameter will be used only when PLLI2S is selected as Clock Source SAI 

    uint32_t PLLI2SP;    // Specifies the division factor for SPDIF-RX clock.
                         // This parameter must be a value of @ref RCCEx_PLLI2SP_Clock_Divider.
                         // This parameter will be used only when PLLI2S is selected as Clock Source SPDIF-RX 
} RCC_PLLI2SInitTypeDef;
typedef struct
{
    uint32_t PLLSAIN;    // Specifies the multiplication factor for PLLI2S VCO output clock.
                         // This parameter must be a number between Min_Data = 50 and Max_Data = 432.
                         // This parameter will be used only when PLLSAI is selected as Clock Source SAI or LTDC 

    uint32_t PLLSAIQ;    // Specifies the division factor for SAI1 clock.
                         // This parameter must be a number between Min_Data = 2 and Max_Data = 15.
                         // This parameter will be used only when PLLSAI is selected as Clock Source SAI or LTDC 

    uint32_t PLLSAIR;    // specifies the division factor for LTDC clock
                         // This parameter must be a number between Min_Data = 2 and Max_Data = 7.
                         // This parameter will be used only when PLLSAI is selected as Clock Source LTDC 

    uint32_t PLLSAIP;    // Specifies the division factor for 48MHz clock.
                         // This parameter must be a value of @ref RCCEx_PLLSAIP_Clock_Divider
                         // This parameter will be used only when PLLSAI is disabled 
} RCC_PLLSAIInitTypeDef;
typedef struct
{
    uint32_t PeriphClockSelection; // The Extended Clock to be configured.This parameter can be a value of @ref RCCEx_Periph_Clock_Selection 
    RCC_PLLI2SInitTypeDef PLLI2S;  // PLL I2S structure parameters.This parameter will be used only when PLLI2S is selected as Clock Source I2S or SAI 
    RCC_PLLSAIInitTypeDef PLLSAI;  // PLL SAI structure parameters.This parameter will be used only when PLLI2S is selected as Clock Source SAI or LTDC 
    uint32_t PLLI2SDivQ;           // Specifies the PLLI2S division factor for SAI1 clock.This parameter must be a number between Min_Data = 1 and Max_Data = 32
                                   // This parameter will be used only when PLLI2S is selected as Clock Source SAI 
    uint32_t PLLSAIDivQ;           // Specifies the PLLI2S division factor for SAI1 clock.
                                   // This parameter must be a number between Min_Data = 1 and Max_Data = 32
                                   // This parameter will be used only when PLLSAI is selected as Clock Source SAI 
    uint32_t PLLSAIDivR;           // Specifies the PLLSAI division factor for LTDC clock.
                                   // This parameter must be one value of @ref RCCEx_PLLSAI_DIVR 
    uint32_t RTCClockSelection;    // Specifies RTC Clock source Selection.
                                   // This parameter can be a value of @ref RCC_RTC_Clock_Source 
    uint32_t I2sClockSelection;    // Specifies I2S Clock source Selection.
                                   // This parameter can be a value of @ref RCCEx_I2S_Clock_Source 
    uint32_t TIMPresSelection;     // Specifies TIM Clock Prescalers Selection.
                                   // This parameter can be a value of @ref RCCEx_TIM_Prescaler_Selection 
    uint32_t Sai1ClockSelection;   // Specifies SAI1 Clock Prescalers Selection
                                   // This parameter can be a value of @ref RCCEx_SAI1_Clock_Source 
    uint32_t Sai2ClockSelection;   // Specifies SAI2 Clock Prescalers Selection
                                   // This parameter can be a value of @ref RCCEx_SAI2_Clock_Source 
    uint32_t Usart1ClockSelection; // USART1 clock source
                                   // This parameter can be a value of @ref RCCEx_USART1_Clock_Source 
    uint32_t Usart2ClockSelection; // USART2 clock source
                                   // This parameter can be a value of @ref RCCEx_USART2_Clock_Source 
    uint32_t Usart3ClockSelection; // USART3 clock source
                                   // This parameter can be a value of @ref RCCEx_USART3_Clock_Source 

    uint32_t Uart4ClockSelection;  // UART4 clock source
                                   // This parameter can be a value of @ref RCCEx_UART4_Clock_Source 

