nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.h
    uint32_t Uart5ClockSelection;  // UART5 clock source
                                   // This parameter can be a value of @ref RCCEx_UART5_Clock_Source 

    uint32_t Usart6ClockSelection;  // USART6 clock source
                                   // This parameter can be a value of @ref RCCEx_USART6_Clock_Source 

    uint32_t Uart7ClockSelection;  // UART7 clock source
                                   // This parameter can be a value of @ref RCCEx_UART7_Clock_Source 

    uint32_t Uart8ClockSelection;  // UART8 clock source
                                   // This parameter can be a value of @ref RCCEx_UART8_Clock_Source 

    uint32_t I2c1ClockSelection;   // I2C1 clock source
                                   // This parameter can be a value of @ref RCCEx_I2C1_Clock_Source 

    uint32_t I2c2ClockSelection;   // I2C2 clock source
                                   // This parameter can be a value of @ref RCCEx_I2C2_Clock_Source 

    uint32_t I2c3ClockSelection;   // I2C3 clock source
                                   // This parameter can be a value of @ref RCCEx_I2C3_Clock_Source 

    uint32_t I2c4ClockSelection;   // I2C4 clock source
                                   // This parameter can be a value of @ref RCCEx_I2C4_Clock_Source 

    uint32_t Lptim1ClockSelection;   // Specifies LPTIM1 clock source
                                     // This parameter can be a value of @ref RCCEx_LPTIM1_Clock_Source 

    uint32_t CecClockSelection;      // CEC clock source
                                     // This parameter can be a value of @ref RCCEx_CEC_Clock_Source 

    uint32_t Clk48ClockSelection;    // Specifies 48Mhz clock source used by USB OTG FS, RNG and SDMMC
                                     // This parameter can be a value of @ref RCCEx_CLK48_Clock_Source 

    uint32_t Sdmmc1ClockSelection;     // SDMMC1 clock source
                                     // This parameter can be a value of @ref RCCEx_SDMMC1_Clock_Source 

    uint32_t Sdmmc2ClockSelection;     // SDMMC2 clock source
                                     // This parameter can be a value of @ref RCCEx_SDMMC2_Clock_Source 

    uint32_t Dfsdm1ClockSelection;     // DFSDM1 clock source
                                     // This parameter can be a value of @ref RCCEx_DFSDM1_Kernel_Clock_Source 

    uint32_t Dfsdm1AudioClockSelection; // DFSDM1 clock source
                                     // This parameter can be a value of @ref RCCEx_DFSDM1_AUDIO_Clock_Source 
} RCC_PeriphCLKInitTypeDef;
typedef struct
{
    uint32_t VirtualChannelID;             // Virtual channel ID                                                 
    uint32_t ColorCoding;                  // Color coding for LTDC interface
                                           // This parameter can be any value of @ref DSI_Color_Coding           
    uint32_t LooselyPacked;                // Enable or disable loosely packed stream (needed only when using
                                           // 18-bit configuration).
                                           // This parameter can be any value of @ref DSI_LooselyPacked          
    uint32_t Mode;                         // Video mode type
                                           // This parameter can be any value of @ref DSI_Video_Mode_Type        
    uint32_t PacketSize;                   // Video packet size                                                  
    uint32_t NumberOfChunks;               // Number of chunks                                                   
    uint32_t NullPacketSize;               // Null packet size                                                   
    uint32_t HSPolarity;                   // HSYNC pin polarity
                                           // This parameter can be any value of @ref DSI_HSYNC_Polarity         
    uint32_t VSPolarity;                   // VSYNC pin polarity
                                           // This parameter can be any value of @ref DSI_VSYNC_Polarity         
    uint32_t DEPolarity;                   // Data Enable pin polarity
                                           // This parameter can be any value of @ref DSI_DATA_ENABLE_Polarity   
    uint32_t HorizontalSyncActive;         // Horizontal synchronism active duration (in lane byte clock cycles) 
    uint32_t HorizontalBackPorch;          // Horizontal back-porch duration (in lane byte clock cycles)         
    uint32_t HorizontalLine;               // Horizontal line duration (in lane byte clock cycles)               
    uint32_t VerticalSyncActive;           // Vertical synchronism active duration                               
    uint32_t VerticalBackPorch;            // Vertical back-porch duration                                       
    uint32_t VerticalFrontPorch;           // Vertical front-porch duration                                      
    uint32_t VerticalActive;               // Vertical active duration                                           
    uint32_t LPCommandEnable;              // Low-power command enable
                                           // This parameter can be any value of @ref DSI_LP_Command             
    uint32_t LPLargestPacketSize;          // The size, in bytes, of the low power largest packet that
                                            //    can fit in a line during VSA, VBP and VFP regions                  
    uint32_t LPVACTLargestPacketSize;      // The size, in bytes, of the low power largest packet that
                                           //     can fit in a line during VACT region                               
    uint32_t LPHorizontalFrontPorchEnable; // Low-power horizontal front-porch enable
                                           // This parameter can be any value of @ref DSI_LP_HFP                 
    uint32_t LPHorizontalBackPorchEnable;  // Low-power horizontal back-porch enable
                                           // This parameter can be any value of @ref DSI_LP_HBP                 
    uint32_t LPVerticalActiveEnable;       // Low-power vertical active enable
                                           // This parameter can be any value of @ref DSI_LP_VACT                
    uint32_t LPVerticalFrontPorchEnable;   // Low-power vertical front-porch enable
                                           // This parameter can be any value of @ref DSI_LP_VFP                 
    uint32_t LPVerticalBackPorchEnable;    // Low-power vertical back-porch enable
                                           // This parameter can be any value of @ref DSI_LP_VBP                 
    uint32_t LPVerticalSyncActiveEnable;   // Low-power vertical sync active enable
                                           // This parameter can be any value of @ref DSI_LP_VSYNC               
    uint32_t FrameBTAAcknowledgeEnable;    // Frame bus-turn-around acknowledge enable
                                           // This parameter can be any value of @ref DSI_FBTA_acknowledge       
} DSI_VidCfgTypeDef;
typedef struct
{
    uint32_t AutomaticClockLaneControl; // Automatic clock lane control
                                        // This parameter can be any value of @ref DSI_Automatic_Clk_Lane_Control 
    uint32_t TXEscapeCkdiv;             // TX Escape clock division
                                        //   The values 0 and 1 stop the TX_ESC clock generation                    
    uint32_t NumberOfLanes;             // Number of lanes
                                        // This parameter can be any value of @ref DSI_Number_Of_Lanes            
} DSI_InitTypeDef;
typedef struct
{
    DSI_TypeDef* Instance;    // Register base address      
    DSI_InitTypeDef           Init;         // DSI required parameters    
    HAL_LockTypeDef           Lock;         // DSI peripheral status      
    __IO HAL_DSI_StateTypeDef State;        // DSI communication state    
    __IO uint32_t             ErrorCode;    // DSI Error code             
    uint32_t                  ErrorMsk;     // DSI Error monitoring mask  
} DSI_HandleTypeDef;



//______________________________________________________________________
// Touch
//___________________________________________________________________
#define WRITE_REG(REG, VAL)   ((REG) = (VAL))
#define READ_REG(REG)         ((REG))

