nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.h
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))



typedef enum
{
    TS_OK = 0x00, /*!< Touch Ok */
    TS_ERROR = 0x01, /*!< Touch Error */
    TS_TIMEOUT = 0x02, /*!< Touch Timeout */
    TS_DEVICE_NOT_FOUND = 0x03  /*!< Touchscreen device not found */
} TS_StatusTypeDef;

#define TS_I2C_ADDRESS     ((uint16_t)0x54)
#define TS_I2C_ADDRESS_A02 ((uint16_t)0x70)
#define TS_SWAP_NONE                    ((uint8_t) 0x01)
#define TS_SWAP_Y                       ((uint8_t) 0x04)
#define TS_SWAP_XY                      ((uint8_t) 0x08)

#define FT6206_GMODE_REG                0xA4
#define FT6206_G_MODE_INTERRUPT_POLLING 0x00
#define FT6206_P1_XH_REG                0x03
#define FT6206_P2_XH_REG               0x09
#define FT6206_MSB_MASK                 0x0F
#define FT6206_LSB_MASK                 0xFF
#define FT6206_G_MODE_INTERRUPT_TRIGGER 0x01
#define FT6206_G_MODE_INTERRUPT_MASK    0x03
#define FT6206_G_MODE_INTERRUPT_SHIFT   0x00
#define FT6206_I2C_NOT_INITIALIZED      0
#define FT6206_MAX_DETECTABLE_TOUCH     2
#define FT6206_TD_STAT_MASK             0x0F
#define FT6206_TD_STAT_REG              0x02
#define FT6206_ID_VALUE                 0x11
#define FT6206_STATUS_OK                0
#define FT6206_CHIP_ID_REG              0xA8
#define FT6x06_MAX_INSTANCE  2
typedef struct
{
    uint8_t i2cInitialized;

    /* field holding the current number of simultaneous active touches */
    uint8_t currActiveTouchNb;

    /* field holding the touch index currently managed */
    uint8_t currActiveTouchIdx;

} ft6x06_handle_TypeDef;

void ft6x06_TS_GetXY(uint16_t DeviceAddr, uint16_t* X, uint16_t* Y);
void ft6x06_Reset(uint16_t DeviceAddr);
void ft6x06_TS_Start(uint16_t DeviceAddr);
void ft6x06_TS_ClearIT(uint16_t DeviceAddr);
void ft6x06_TS_DisableIT(uint16_t DeviceAddr);
void ft6x06_TS_EnableIT(uint16_t DeviceAddr);
void ft6x06_Init(uint16_t DeviceAddr);
uint8_t ft6x06_TS_DetectTouch(uint16_t DeviceAddr);
uint8_t ft6x06_TS_ITStatus(uint16_t DeviceAddr);
uint8_t ft6x06_GetInstance(uint16_t DeviceAddr);
uint16_t ft6x06_ReadID(uint16_t DeviceAddr);

typedef struct
{
    void       (*Init)(uint16_t);
    uint16_t(*ReadID)(uint16_t);
    void       (*Reset)(uint16_t);
    void       (*Start)(uint16_t);
    uint8_t(*DetectTouch)(uint16_t);
    void       (*GetXY)(uint16_t, uint16_t*, uint16_t*);
    void       (*EnableIT)(uint16_t);
    void       (*ClearIT)(uint16_t);
    uint8_t(*GetITStatus)(uint16_t);
    void       (*DisableIT)(uint16_t);
} TS_DrvTypeDef;


TS_DrvTypeDef ft6x06_ts_drv =
{
  ft6x06_Init,
  ft6x06_ReadID,
  ft6x06_Reset,
  ft6x06_TS_Start,
  ft6x06_TS_DetectTouch,
  ft6x06_TS_GetXY,
  ft6x06_TS_EnableIT,
  ft6x06_TS_ClearIT,
  ft6x06_TS_ITStatus,
  ft6x06_TS_DisableIT
};


typedef enum
{
    HAL_I2C_STATE_RESET = 0x00U,   /*!< Peripheral is not yet Initialized         */
    HAL_I2C_STATE_READY = 0x20U,   /*!< Peripheral Initialized and ready for use  */
    HAL_I2C_STATE_BUSY = 0x24U,   /*!< An internal process is ongoing            */
    HAL_I2C_STATE_BUSY_TX = 0x21U,   /*!< Data Transmission process is ongoing      */
    HAL_I2C_STATE_BUSY_RX = 0x22U,   /*!< Data Reception process is ongoing         */
    HAL_I2C_STATE_LISTEN = 0x28U,   /*!< Address Listen Mode is ongoing            */
    HAL_I2C_STATE_BUSY_TX_LISTEN = 0x29U,   /*!< Address Listen Mode and Data Transmission
                                                   process is ongoing                         */
                                                   HAL_I2C_STATE_BUSY_RX_LISTEN = 0x2AU,   /*!< Address Listen Mode and Data Reception
                                                                                                  process is ongoing                         */
                                                                                                  HAL_I2C_STATE_ABORT = 0x60U,   /*!< Abort user request ongoing                */
                                                                                                  HAL_I2C_STATE_TIMEOUT = 0xA0U,   /*!< Timeout state                             */
                                                                                                  HAL_I2C_STATE_ERROR = 0xE0U    /*!< Error                                     */

} HAL_I2C_StateTypeDef;

#define HAL_I2C_ERROR_INVALID_PARAM     (0x00000200U)    /*!< Invalid Parameters error  */
#define HAL_I2C_ERROR_NONE      (0x00000000U)    /*!< No error              */
#define HAL_I2C_ERROR_TIMEOUT   (0x00000020U)    /*!< Timeout error         */

#define HAL_MAX_DELAY      0xFFFFFFFFU
#define MAX_NBYTE_SIZE      255U

#define I2C_MEMADD_SIZE_8BIT            (0x00000001U)
#define I2C_MEMADD_SIZE_16BIT           (0x00000002U)
#define I2C_FLAG_BUSY                       I2C_ISR_BUSY
#define I2C_FLAG_RXNE                       I2C_ISR_RXNE
#define I2C_FLAG_TCR                        I2C_ISR_TCR
#define I2C_FLAG_STOPF                      I2C_ISR_STOPF
#define I2C_NO_STARTSTOP                    (0x00000000U)
#define I2C_GENERATE_STOP                   (uint32_t)(0x80000000U | I2C_CR2_STOP)
#define I2C_GENERATE_START_READ             (uint32_t)(0x80000000U | I2C_CR2_START | I2C_CR2_RD_WRN)
#define I2C_GENERATE_START_WRITE            (uint32_t)(0x80000000U | I2C_CR2_START)
#define I2C_TIMEOUT_BUSY    (25U)           /*!< 25 ms */
#define IS_I2C_MEMADD_SIZE(SIZE)            (((SIZE) == I2C_MEMADD_SIZE_8BIT) || ((SIZE) == I2C_MEMADD_SIZE_16BIT))
                                       
#define I2C_RELOAD_MODE                    I2C_CR2_RELOAD
#define I2C_AUTOEND_MODE                   I2C_CR2_AUTOEND
#define I2C_SOFTEND_MODE                   (0x00000000U)

#define IS_TRANSFER_MODE(MODE)              (((MODE) == I2C_RELOAD_MODE)            || \
                                            ((MODE) == I2C_AUTOEND_MODE)            || \
                                            ((MODE) == I2C_SOFTEND_MODE))
#define IS_TRANSFER_REQUEST(REQUEST)        (((REQUEST) == I2C_GENERATE_STOP)       || \
                                            ((REQUEST) == I2C_GENERATE_START_READ)  || \
                                            ((REQUEST) == I2C_GENERATE_START_WRITE) || \
                                            ((REQUEST) == I2C_NO_STARTSTOP))
#define I2C_FLAG_TXIS                   I2C_ISR_TXIS
#define I2C_FLAG_TC                     I2C_ISR_TC

#define DISCOVERY_AUDIO_I2Cx                             I2C4
#define DISCOVERY_EXT_I2Cx                             I2C1
#define DISCOVERY_I2Cx_TIMING                      ((uint32_t)0x40912732)

