nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.h
    uint32_t NoStretchMode;       /*!< Specifies if nostretch mode is selected.
                                    This parameter can be a value of @ref I2C_NOSTRETCH_MODE */

} I2C_InitTypeDef;
typedef struct
{
    uint32_t Channel;              /*!< Specifies the channel used for the specified stream.
                                        This parameter can be a value of @ref DMAEx_Channel_selection                  */

    uint32_t Direction;            /*!< Specifies if the data will be transferred from memory to peripheral,
                                        from memory to memory or from peripheral to memory.
                                        This parameter can be a value of @ref DMA_Data_transfer_direction              */

    uint32_t PeriphInc;            /*!< Specifies whether the Peripheral address register should be incremented or not.
                                        This parameter can be a value of @ref DMA_Peripheral_incremented_mode          */

    uint32_t MemInc;               /*!< Specifies whether the memory address register should be incremented or not.
                                        This parameter can be a value of @ref DMA_Memory_incremented_mode              */

    uint32_t PeriphDataAlignment;  /*!< Specifies the Peripheral data width.
                                        This parameter can be a value of @ref DMA_Peripheral_data_size                 */

    uint32_t MemDataAlignment;     /*!< Specifies the Memory data width.
                                        This parameter can be a value of @ref DMA_Memory_data_size                     */

    uint32_t Mode;                 /*!< Specifies the operation mode of the DMAy Streamx.
                                        This parameter can be a value of @ref DMA_mode
                                        @note The circular buffer mode cannot be used if the memory-to-memory
                                              data transfer is configured on the selected Stream                        */

    uint32_t Priority;             /*!< Specifies the software priority for the DMAy Streamx.
                                        This parameter can be a value of @ref DMA_Priority_level                       */

    uint32_t FIFOMode;             /*!< Specifies if the FIFO mode or Direct mode will be used for the specified stream.
                                        This parameter can be a value of @ref DMA_FIFO_direct_mode
                                        @note The Direct mode (FIFO mode disabled) cannot be used if the
                                              memory-to-memory data transfer is configured on the selected stream       */

    uint32_t FIFOThreshold;        /*!< Specifies the FIFO threshold level.
                                        This parameter can be a value of @ref DMA_FIFO_threshold_level                  */

    uint32_t MemBurst;             /*!< Specifies the Burst transfer configuration for the memory transfers.
                                        It specifies the amount of data to be transferred in a single non interruptible
                                        transaction.
                                        This parameter can be a value of @ref DMA_Memory_burst
                                        @note The burst mode is possible only if the address Increment mode is enabled. */

    uint32_t PeriphBurst;          /*!< Specifies the Burst transfer configuration for the peripheral transfers.
                                        It specifies the amount of data to be transferred in a single non interruptible
                                        transaction.
                                        This parameter can be a value of @ref DMA_Peripheral_burst
                                        @note The burst mode is possible only if the address Increment mode is enabled. */
}DMA_InitTypeDef;
typedef struct __DMA_HandleTypeDef
{
    DMA_Stream_TypeDef* Instance;                                                    /*!< Register base address                  */

    DMA_InitTypeDef            Init;                                                         /*!< DMA communication parameters           */

    HAL_LockTypeDef            Lock;                                                         /*!< DMA locking object                     */

    __IO HAL_DMA_StateTypeDef  State;                                                        /*!< DMA transfer state                     */

    void* Parent;                                                      /*!< Parent object state                    */

    void                       (*XferCpltCallback)(struct __DMA_HandleTypeDef* hdma);     /*!< DMA transfer complete callback         */

    void                       (*XferHalfCpltCallback)(struct __DMA_HandleTypeDef* hdma); /*!< DMA Half transfer complete callback    */

    void                       (*XferM1CpltCallback)(struct __DMA_HandleTypeDef* hdma);   /*!< DMA transfer complete Memory1 callback */

    void                       (*XferM1HalfCpltCallback)(struct __DMA_HandleTypeDef* hdma);   /*!< DMA transfer Half complete Memory1 callback */

    void                       (*XferErrorCallback)(struct __DMA_HandleTypeDef* hdma);    /*!< DMA transfer error callback            */

    void                       (*XferAbortCallback)(struct __DMA_HandleTypeDef* hdma);    /*!< DMA transfer Abort callback            */

    __IO uint32_t               ErrorCode;                                                    /*!< DMA Error code                          */

    uint32_t                    StreamBaseAddress;                                            /*!< DMA Stream Base Address                */

    uint32_t                    StreamIndex;                                                  /*!< DMA Stream Index                       */

}DMA_HandleTypeDef;
typedef struct
{
    uint32_t SDBank;                      /*!< Specifies the SDRAM memory device that will be used.
                                               This parameter can be a value of @ref FMC_SDRAM_Bank                */

    uint32_t ColumnBitsNumber;            /*!< Defines the number of bits of column address.
                                               This parameter can be a value of @ref FMC_SDRAM_Column_Bits_number. */

    uint32_t RowBitsNumber;               /*!< Defines the number of bits of column address.
                                               This parameter can be a value of @ref FMC_SDRAM_Row_Bits_number.    */

    uint32_t MemoryDataWidth;             /*!< Defines the memory device width.
                                               This parameter can be a value of @ref FMC_SDRAM_Memory_Bus_Width.   */

    uint32_t InternalBankNumber;          /*!< Defines the number of the device's internal banks.
                                               This parameter can be of @ref FMC_SDRAM_Internal_Banks_Number.      */

    uint32_t CASLatency;                  /*!< Defines the SDRAM CAS latency in number of memory clock cycles.
                                               This parameter can be a value of @ref FMC_SDRAM_CAS_Latency.        */

    uint32_t WriteProtection;             /*!< Enables the SDRAM device to be accessed in write mode.
                                               This parameter can be a value of @ref FMC_SDRAM_Write_Protection.   */

    uint32_t SDClockPeriod;               /*!< Define the SDRAM Clock Period for both SDRAM devices and they allow
                                               to disable the clock before changing frequency.
                                               This parameter can be a value of @ref FMC_SDRAM_Clock_Period.       */

    uint32_t ReadBurst;                   /*!< This bit enable the SDRAM controller to anticipate the next read
                                               commands during the CAS latency and stores data in the Read FIFO.
                                               This parameter can be a value of @ref FMC_SDRAM_Read_Burst.         */

    uint32_t ReadPipeDelay;               /*!< Define the delay in system clock cycles on read data path.
                                               This parameter can be a value of @ref FMC_SDRAM_Read_Pipe_Delay.    */
} FMC_SDRAM_InitTypeDef;

