nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.h
typedef struct __I2C_HandleTypeDef
{
    I2C_TypeDef* Instance;      /*!< I2C registers base address                */

    I2C_InitTypeDef            Init;           /*!< I2C communication parameters              */

    uint8_t* pBuffPtr;      /*!< Pointer to I2C transfer buffer            */

    uint16_t                   XferSize;       /*!< I2C transfer size                         */

    __IO uint16_t              XferCount;      /*!< I2C transfer counter                      */

    __IO uint32_t              XferOptions;    /*!< I2C sequantial transfer options, this parameter can
                                                    be a value of @ref I2C_XFEROPTIONS */

    __IO uint32_t              PreviousState;  /*!< I2C communication Previous state          */

    HAL_StatusTypeDef(*XferISR)(struct __I2C_HandleTypeDef* hi2c, uint32_t ITFlags, uint32_t ITSources);  /*!< I2C transfer IRQ handler function pointer */

    DMA_HandleTypeDef* hdmatx;        /*!< I2C Tx DMA handle parameters              */

    DMA_HandleTypeDef* hdmarx;        /*!< I2C Rx DMA handle parameters              */

    HAL_LockTypeDef            Lock;           /*!< I2C locking object                        */

    __IO HAL_I2C_StateTypeDef  State;          /*!< I2C communication state                   */

    __IO HAL_I2C_ModeTypeDef   Mode;           /*!< I2C communication mode                    */

    __IO uint32_t              ErrorCode;      /*!< I2C Error code                            */

    __IO uint32_t              AddrEventCount; /*!< I2C Address Event counter                 */

#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
    void (*MasterTxCpltCallback)(struct __I2C_HandleTypeDef* hi2c);           /*!< I2C Master Tx Transfer completed callback */
    void (*MasterRxCpltCallback)(struct __I2C_HandleTypeDef* hi2c);           /*!< I2C Master Rx Transfer completed callback */
    void (*SlaveTxCpltCallback)(struct __I2C_HandleTypeDef* hi2c);            /*!< I2C Slave Tx Transfer completed callback  */
    void (*SlaveRxCpltCallback)(struct __I2C_HandleTypeDef* hi2c);            /*!< I2C Slave Rx Transfer completed callback  */
    void (*ListenCpltCallback)(struct __I2C_HandleTypeDef* hi2c);             /*!< I2C Listen Complete callback              */
    void (*MemTxCpltCallback)(struct __I2C_HandleTypeDef* hi2c);              /*!< I2C Memory Tx Transfer completed callback */
    void (*MemRxCpltCallback)(struct __I2C_HandleTypeDef* hi2c);              /*!< I2C Memory Rx Transfer completed callback */
    void (*ErrorCallback)(struct __I2C_HandleTypeDef* hi2c);                  /*!< I2C Error callback                        */
    void (*AbortCpltCallback)(struct __I2C_HandleTypeDef* hi2c);              /*!< I2C Abort callback                        */

    void (*AddrCallback)(struct __I2C_HandleTypeDef* hi2c, uint8_t TransferDirection, uint16_t AddrMatchCode);  /*!< I2C Slave Address Match callback */

    void (*MspInitCallback)(struct __I2C_HandleTypeDef* hi2c);                /*!< I2C Msp Init callback                     */
    void (*MspDeInitCallback)(struct __I2C_HandleTypeDef* hi2c);              /*!< I2C Msp DeInit callback                   */

#endif  /* USE_HAL_I2C_REGISTER_CALLBACKS */
} I2C_HandleTypeDef;

#define FMC_SDRAM_TypeDef              FMC_Bank5_6_TypeDef
#define SDRAM_DMAx_CHANNEL                DMA_CHANNEL_0
#define SDRAM_DMAx_STREAM                 DMA2_Stream0  
#define SDRAM_DMAx_IRQn                   DMA2_Stream0_IRQn

#define DMA_FIFOMODE_DISABLE                     0x00000000U       /*!< FIFO mode disable */
#define __HAL_LINKDMA(__HANDLE__, __PPP_DMA_FIELD__, __DMA_HANDLE__)               \
                        do{                                                      \
                              (__HANDLE__)->__PPP_DMA_FIELD__ = &(__DMA_HANDLE__); \
                              (__DMA_HANDLE__).Parent = (__HANDLE__);             \
                          } while(0)

#define HAL_LTDC_ERROR_NONE               0x00000000U   /*!< LTDC No error             */

#define __HAL_LTDC_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER |= (__INTERRUPT__))
#define __HAL_LTDC_ENABLE(__HANDLE__)    ((__HANDLE__)->Instance->GCR |= LTDC_GCR_LTDCEN)
#define HAL_DMA_ERROR_NONE                       0x00000000U    /*!< No error                               */
#define LCD_BL_CTRL_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOK_CLK_ENABLE()
#define __HAL_RCC_GPIOK_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg; \
                                        SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOKEN);\
                                        /* Delay after an RCC peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOKEN);\
                                        UNUSED(tmpreg); \
                                      } while(0)

#define __HAL_DMA_DISABLE(__HANDLE__)     ((__HANDLE__)->Instance->CR &=  ~DMA_SxCR_EN)
#define HAL_TIMEOUT_DMA_ABORT    ((uint32_t)5)  /* 5 ms */
#define HAL_DMA_ERROR_TIMEOUT                    0x00000020U    /*!< Timeout error                          */

#define DMA_FIFOMODE_ENABLE                      DMA_SxFCR_DMDIS   /*!< FIFO mode enable  */
#define HAL_DMA_ERROR_PARAM                      0x00000040U    /*!< Parameter error                        */

typedef enum
{
    LCD_ORIENTATION_PORTRAIT = 0x00, /*!< Portrait orientation choice of LCD screen  */
    LCD_ORIENTATION_LANDSCAPE = 0x01, /*!< Landscape orientation choice of LCD screen */
    LCD_ORIENTATION_INVALID = 0x02  /*!< Invalid orientation choice of LCD screen   */
} LCD_OrientationTypeDef;

#define LCD_OK                         0x00
#define LCD_BL_CTRL_GPIO_PORT           GPIOK
#define LCD_DISP_PIN                    GPIO_PIN_12
#define LCD_DISP_GPIO_PORT              GPIOI
#define LCD_BL_CTRL_PIN                 GPIO_PIN_3
#define LCD_COLOR_WHITE                ((uint32_t) 0xFFFFFFFF)
#define LCD_COLOR_BLACK                ((uint32_t) 0xFF000000)
#define LCD_LayerCfgTypeDef            LTDC_LayerCfgTypeDef
#define LCD_DSI_PIXEL_DATA_FMT_RBG565  DSI_RGB565                // DSI packet pixel format chosen is RGB565 : 16 bpp

#define LCD_OTM8009A_ID                (uint32_t) 0 
#define  OTM8009A_480X800_HBP          ((uint16_t)120)           // Horizontal back porch      
#define  OTM8009A_480X800_HFP          ((uint16_t)120)           // Horizontal front porch     
#define  OTM8009A_480X800_VSYNC        ((uint16_t)12)            // Vertical synchronization   
#define  OTM8009A_480X800_VBP          ((uint16_t)12)            // Vertical back porch        
#define  OTM8009A_480X800_VFP          ((uint16_t)12)            // Vertical front porch       
#define  OTM8009A_480X800_HSYNC        ((uint16_t)63)            // Horizontal synchronization: This value is set to limit value mentionned 
#define OTM8009A_FORMAT_RGB888    ((uint32_t)0x00) /* Pixel format chosen is RGB888 : 24 bpp */
#define OTM8009A_FORMAT_RBG565    ((uint32_t)0x02) /* Pixel format chosen is RGB565 : 16 bpp */
uint8_t OTM8009A_Init(uint32_t ColorCoding, uint32_t orientation);


typedef struct
{
    uint32_t TextColor; /*!< Specifies the color of text */
    uint32_t BackColor; /*!< Specifies the background color below the text */
    //sFONT* pFont;    /*!< Specifies the font used for the text */

} LCD_DrawPropTypeDef;

#define __HAL_DSI_ENABLE(__HANDLE__) do { \
                                          __IO uint32_t tmpreg = 0x00U; \
                                          SET_BIT((__HANDLE__)->Instance->CR, DSI_CR_EN);\
                                          /* Delay after an DSI Host enabling */ \
                                          tmpreg = READ_BIT((__HANDLE__)->Instance->CR, DSI_CR_EN);\
                                          UNUSED(tmpreg); \
                                        } while(0U)
#define __HAL_DSI_WRAPPER_ENABLE(__HANDLE__) do { \
                                                 __IO uint32_t tmpreg = 0x00U; \
                                                 SET_BIT((__HANDLE__)->Instance->WCR, DSI_WCR_DSIEN);\
                                                 /* Delay after an DSI warpper enabling */ \
                                                 tmpreg = READ_BIT((__HANDLE__)->Instance->WCR, DSI_WCR_DSIEN);\
                                                 UNUSED(tmpreg); \
                                                } while(0U)



#define RCC_PLLSAIDIVR_2                ((uint32_t)0x00000000U)
#define RCC_PLLSAIDIVR_4                RCC_DCKCFGR1_PLLSAIDIVR_0
#define RCC_PLLSAIDIVR_8                RCC_DCKCFGR1_PLLSAIDIVR_1
#define RCC_PLLSAIDIVR_16               RCC_DCKCFGR1_PLLSAIDIVR

#define IS_RCC_PLLSAI_DIVR_VALUE(VALUE) (((VALUE) == RCC_PLLSAIDIVR_2) ||\
                                         ((VALUE) == RCC_PLLSAIDIVR_4) ||\
                                         ((VALUE) == RCC_PLLSAIDIVR_8) ||\
                                         ((VALUE) == RCC_PLLSAIDIVR_16))
#define IS_RCC_PLLSAIR_VALUE(VALUE)      ((2 <= (VALUE)) && ((VALUE) <= 7))
#define IS_RCC_PLLSAI_DIVQ_VALUE(VALUE)  ((1 <= (VALUE)) && ((VALUE) <= 32))
#define IS_RCC_PLLSAIQ_VALUE(VALUE)      ((2 <= (VALUE)) && ((VALUE) <= 15))

