nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.h
    uint32_t SelfRefreshTime;              /*!< Defines the minimum Self Refresh period in number of memory clock
                                                cycles.
                                                This parameter can be a value between Min_Data = 1 and Max_Data = 16  */

    uint32_t RowCycleDelay;                /*!< Defines the delay between the Refresh command and the Activate command
                                                and the delay between two consecutive Refresh commands in number of
                                                memory clock cycles.
                                                This parameter can be a value between Min_Data = 1 and Max_Data = 16  */

    uint32_t WriteRecoveryTime;            /*!< Defines the Write recovery Time in number of memory clock cycles.
                                                This parameter can be a value between Min_Data = 1 and Max_Data = 16  */

    uint32_t RPDelay;                      /*!< Defines the delay between a Precharge Command and an other command
                                                in number of memory clock cycles.
                                                This parameter can be a value between Min_Data = 1 and Max_Data = 16  */

    uint32_t RCDDelay;                     /*!< Defines the delay between the Activate Command and a Read/Write
                                                command in number of memory clock cycles.
                                                This parameter can be a value between Min_Data = 1 and Max_Data = 16  */
}FMC_SDRAM_TimingTypeDef;
typedef struct
{
    __IO uint32_t ISR;   /*!< DMA interrupt status register */
    __IO uint32_t Reserved0;
    __IO uint32_t IFCR;  /*!< DMA interrupt flag clear register */
} DMA_Base_Registers;


static void DSI_ConfigPacketHeader(DSI_TypeDef* DSIx, 
    uint32_t ChannelID, 
    uint32_t DataType, 
    uint32_t Data0,
    uint32_t Data1);


static HAL_StatusTypeDef DMA_CheckFifoParam(DMA_HandleTypeDef* hdma);

HAL_StatusTypeDef FMC_SDRAM_Init(FMC_SDRAM_TypeDef* Device, FMC_SDRAM_InitTypeDef* Init);
HAL_StatusTypeDef FMC_SDRAM_Timing_Init(FMC_SDRAM_TypeDef* Device, FMC_SDRAM_TimingTypeDef* Timing, uint32_t Bank);
HAL_StatusTypeDef  FMC_SDRAM_ProgramRefreshRate(FMC_SDRAM_TypeDef* Device, uint32_t RefreshRate);
HAL_StatusTypeDef FMC_SDRAM_SendCommand(FMC_SDRAM_TypeDef* Device, FMC_SDRAM_CommandTypeDef* Command, uint32_t Timeout);

void HAL_SDRAM_MspInit(SDRAM_HandleTypeDef* hsdram);
HAL_StatusTypeDef HAL_SDRAM_SendCommand(SDRAM_HandleTypeDef* hsdram, FMC_SDRAM_CommandTypeDef* Command, uint32_t Timeout);
HAL_StatusTypeDef HAL_SDRAM_ProgramRefreshRate(SDRAM_HandleTypeDef* hsdram, uint32_t RefreshRate);

HAL_StatusTypeDef HAL_DSI_Start(DSI_HandleTypeDef* hdsi);
static uint32_t DMA_CalcBaseAndBitshift(DMA_HandleTypeDef* hdma);

void HAL_LTDC_MspInit(LTDC_HandleTypeDef* hltdc); 
HAL_StatusTypeDef HAL_LTDC_Init(LTDC_HandleTypeDef* hltdc);
HAL_StatusTypeDef HAL_DMA_Init(DMA_HandleTypeDef* hdma);
HAL_StatusTypeDef HAL_DMA_DeInit(DMA_HandleTypeDef* hdma);

uint8_t BSP_SDRAM_Init(void);
void BSP_SDRAM_MspInit(SDRAM_HandleTypeDef* hsdram, void* Params);
void BSP_SDRAM_Initialization_sequence(uint32_t RefreshCount);


void HAL_NVIC_EnableIRQ(IRQn_Type IRQn);
void HAL_NVIC_SetPriority(IRQn_Type IRQn, uint32_t PreemptPriority, uint32_t SubPriority);

void HAL_GPIO_Init(GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init);


HAL_StatusTypeDef HAL_LTDC_ConfigLayer(LTDC_HandleTypeDef* hltdc, LTDC_LayerCfgTypeDef* pLayerCfg, uint32_t LayerIdx);

void HAL_I2C_MspDeInit(I2C_HandleTypeDef* hi2c);
void HAL_I2C_MspInit(I2C_HandleTypeDef* hi2c);
HAL_StatusTypeDef HAL_I2C_Mem_Write(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t* pData, uint16_t Size, uint32_t Timeout);
HAL_StatusTypeDef HAL_I2C_Init(I2C_HandleTypeDef* hi2c);
HAL_StatusTypeDef HAL_I2C_DeInit(I2C_HandleTypeDef* hi2c);
HAL_I2C_StateTypeDef HAL_I2C_GetState(I2C_HandleTypeDef* hi2c);

static void I2Cx_MspInit(I2C_HandleTypeDef* i2c_handler);
static void I2Cx_Error(I2C_HandleTypeDef* i2c_handler, uint8_t Addr);
static void I2Cx_Init(I2C_HandleTypeDef* i2c_handler);
static HAL_StatusTypeDef I2Cx_WriteMultiple(I2C_HandleTypeDef* i2c_handler, uint8_t Addr, uint16_t Reg, uint16_t MemAddress, uint8_t* Buffer, uint16_t Length);

static void I2C_Flush_TXDR(I2C_HandleTypeDef* hi2c);
static HAL_StatusTypeDef I2C_IsAcknowledgeFailed(I2C_HandleTypeDef* hi2c, uint32_t Timeout, uint32_t Tickstart);
static HAL_StatusTypeDef I2C_WaitOnSTOPFlagUntilTimeout(I2C_HandleTypeDef* hi2c, uint32_t Timeout, uint32_t Tickstart);
static HAL_StatusTypeDef I2C_RequestMemoryRead(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint32_t Timeout, uint32_t Tickstart);
static HAL_StatusTypeDef I2C_WaitOnTXISFlagUntilTimeout(I2C_HandleTypeDef* hi2c, uint32_t Timeout, uint32_t Tickstart);
static HAL_StatusTypeDef I2C_RequestMemoryWrite(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint32_t Timeout, uint32_t Tickstart);
static void I2C_TransferConfig(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint8_t Size, uint32_t Mode, uint32_t Request);
static HAL_StatusTypeDef I2C_WaitOnFlagUntilTimeout(I2C_HandleTypeDef* hi2c, uint32_t Flag, FlagStatus Status, uint32_t Timeout, uint32_t Tickstart);


uint8_t BSP_TS_Init(void);
void TS_IO_Init(void);
uint8_t  TS_IO_Read(uint8_t Addr, uint8_t Reg);
uint16_t TS_IO_ReadMultiple(uint8_t Addr, uint8_t Reg, uint8_t* Buffer, uint16_t Length);
void TS_IO_Write(uint8_t Addr, uint8_t Reg, uint8_t Value);
void TS_IO_WriteMultiple(uint8_t Addr, uint8_t Reg, uint8_t* Buffer, uint16_t Length);

static HAL_StatusTypeDef I2Cx_ReadMultiple(I2C_HandleTypeDef* i2c_handler, uint8_t Addr, uint16_t Reg, uint16_t MemAddSize, uint8_t* Buffer, uint16_t Length);

HAL_StatusTypeDef HAL_SDRAM_Init(SDRAM_HandleTypeDef* hsdram, FMC_SDRAM_TimingTypeDef* Timing);

static void LTDC_SetConfig(LTDC_HandleTypeDef* hltdc, LTDC_LayerCfgTypeDef* pLayerCfg, uint32_t LayerIdx);

HAL_StatusTypeDef HAL_I2C_Mem_Read(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t* pData, uint16_t Size, uint32_t Timeout);

void HAL_DSI_MspInit(void);
void HAL_DSI_MspDeInit(DSI_HandleTypeDef* hdsi);
HAL_StatusTypeDef HAL_DSI_DeInit(DSI_HandleTypeDef* hdsi);
HAL_StatusTypeDef HAL_DSI_ConfigVideoMode(DSI_HandleTypeDef* hdsi, DSI_VidCfgTypeDef* VidCfg);


uint8_t BSP_LCD_InitEx(LCD_OrientationTypeDef orientation);
void BSP_LCD_LayerDefaultInit(uint32_t LayerIndex, uint32_t FB_Address);
void BSP_LCD_MspDeInit(void);
void BSP_LCD_Reset(void);
void BSP_LCD_MspInit(void);
void BSP_LCD_MspDeInit(void);

void HAL_NVIC_DisableIRQ(IRQn_Type IRQn);
void HAL_GPIO_WritePin(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState);
HAL_StatusTypeDef HAL_RCCEx_PeriphCLKConfig(RCC_PeriphCLKInitTypeDef* PeriphClkInit);
HAL_StatusTypeDef HAL_LTDCEx_StructInitFromVideoConfig(LTDC_HandleTypeDef* hltdc, DSI_VidCfgTypeDef* VidCfg);
HAL_StatusTypeDef HAL_DSI_Init(DSI_HandleTypeDef* hdsi, DSI_PLLInitTypeDef* PLLInit);

static void DSI_ConfigPacketHeader(DSI_TypeDef* DSIx, uint32_t ChannelID, uint32_t DataType, uint32_t Data0,
    uint32_t Data1);

static HAL_StatusTypeDef HAL_DSI_ShortWrite(DSI_HandleTypeDef* hdsi,
    uint32_t ChannelID,
    uint32_t Mode,
    uint32_t Param1,
    uint32_t Param2);
HAL_StatusTypeDef HAL_DSI_LongWrite(DSI_HandleTypeDef* hdsi,
    uint32_t ChannelID,
    uint32_t Mode,
    uint32_t NbParams,
    uint32_t Param1,
    uint8_t* ParametersTable);


#endif
